{
  "fr": {
    "Home": {
      "accueil": "Accueil",
      "about": "À propos",
      "download": "Téléchargement",
      "contact": "Contact",
      "colorBlind": "Daltonien",
      "language": "Français",
      "mainContent": {
        "paragraph0": "Storcki Corp vous présente",
        "paragraph6": "Plenty Orders",
        "paragraph7": "Un jeu de cuisine frénétique où rapidité, coordination et fun en multijoueur sont la clé pour réussir chaque service !",
        "paragraph1": "Storcki Corp est bien plus qu’un simple studio de développement de jeux vidéo : <br/><br/> c’est avant tout une aventure humaine née de la rencontre de cinq passionnés au sein de l’école d’ingénierie informatique EPITA à Strasbourg. <br/><br/>Chacun des membres du studio apporte avec lui une histoire, des expériences et des compétences uniques, mais tous partagent un même objectif : <em>créer des jeux innovants et marquants.</em> <br/><br/>Ce projet commun s’est imposé comme une évidence, unissant leurs talents autour d’une vision ambitieuse et d’une passion dévorante pour le jeu vidéo. Et c’est aujourd’hui à Strasbourg, cette ville au carrefour de l’Europe, que Storcki Corp puise son énergie et forge son identité.",
        "paragraph8": "Qui nous sommes",
        "paragraph2": "L’identité visuelle du studio s’est construite naturellement autour d’un symbole fort et évocateur : la cigogne. <br/><br/>Emblème incontournable de l’Alsace, elle représente bien plus qu’un simple clin d'œil régional. <br/>Dans l’imaginaire collectif, la cigogne est un messager, un voyageur infatigable capable de parcourir de longues distances avec une aisance remarquable. <br/><br/>À l’image de cet oiseau, Storcki Corp aspire à concevoir des jeux qui transportent les joueurs dans des univers captivants, où l’expérience de jeu est fluide, immersive et toujours en mouvement. <br/><br/>Le choix de ce symbole traduit aussi l’état d’esprit du studio : une équipe qui ne cesse d’évoluer, d’apprendre et de repousser ses propres limites, avec la volonté constante de livrer des jeux de qualité.",
        "paragraph3": "Au cœur de Storcki Corp, on retrouve un équilibre subtil entre originalité, exigence technique et une touche d’humour qui vient pimenter chacune de leurs créations. <br/><br/>Le studio ne se contente pas de développer des jeux :<br/> il cherche à offrir des expériences singulières, façonnées par un soin minutieux du détail et une approche créative qui ose sortir des sentiers battus. <br/><br/>Loin des standards formatés, chaque projet est une occasion d’explorer de nouvelles idées, d’expérimenter des concepts audacieux et d’insuffler une âme unique aux jeux qui prennent vie sous leurs mains expertes.",
        "paragraph4": "Mais plus qu’un simple collectif de développeurs, Storcki Corp est avant tout une famille, où les valeurs humaines sont placées au premier plan.<br/><br/> L’entraide et l’inclusivité ne sont pas de simples principes affichés, mais des piliers concrets qui structurent le fonctionnement de l’équipe au quotidien.<br/><br/> Chaque membre y trouve sa place, libre d’apporter ses idées, d’exprimer sa créativité et de contribuer activement à l’évolution du studio. Cette synergie entre talents complémentaires et visions partagées est la clé qui permet à Storcki Corp de grandir et d’évoluer vers de nouveaux horizons.",
        "paragraph5": "Merci pour votre soutient !"
      },
      "footer": {
        "terms": "Termes du service",
        "privacy": "Avis de confidentialité",
        "copyright": "&copy; 2025 Storcki Corp. Tous droits réservés."
      }
    },
    "About_Us": {
      "menu": "Accueil",
      "about": "À propos",
      "download": "Télécharger",
      "contact": "Contact",
      "colorBlind": "Daltonien",
      "language": "Français",
      "mainContent": {
        "Motivations": "Nos motivations",
        "Projet": "Un projet passionnant !",
        "Qui": "Nous sommes une équipe de 4 étudiants à l'EPITA, unis par notre passion pour la technologie et le développement. Pour notre projet de second semestre, nous avons choisi de créer un jeu innovant qui nous permettrait de repousser nos limites en programmation et de renforcer notre esprit d'équipe.",
        "Histoire": "L'équipe s'est formée naturellement autour de nos compétences et affinités. <br> Hugo, notre chef de groupe et concepteur de niveaux, apporte une vision claire et structurée. <br> Luc, responsable marketing et gameplay, veille à ce que notre jeu soit à la fois captivant et bien positionné. <br> Raphaël, développeur web et directeur artistique, donne vie à notre projet avec son talent créatif. <br> Enfin, Thomas, expert en multijoueur et IA, assure une expérience de jeu fluide et intelligente.",
        "Hugo1": "<strong>Hugo BEFORT</strong>",
        "Hugo2": "<strong> Chef de groupe et concepteur niveaux</strong>",
        "Hugo3": "Hugo Befort, notre chef de projet, a été désigné naturellement grâce à son sens de l'organisation et son esprit stratégique. Avec ses 18 ans, il a une maturité qui dépasse largement son âge, et il sait gérer une équipe avec une confiance déconcertante.",
        "Hugo4": "",
        "Hugo5": "",
        "Luc1": "<strong> Luc BEVILLAQUA </strong>",
        "Luc2": "<strong>Responsable Marketing et Gameplay</strong>",
        "Luc3": "Luc, notre responsable marketing, n’est pas là seulement pour gérer le marketing, mais aussi pour jouer au couteau suisse du groupe. Polyvalent et prêt à dégainer son aide à tout moment, il peut être dans la pub d’un instant, puis donner un coup de main à la technique le lendemain. Son objectif : faire briller le projet tout en assurant que personne ne se perde en cours de route.",
        "Luc4": "",
        "Luc5": "",
        "Raph1": "<strong>Raphaël CHABOISSEAU</strong> ",
        "Raph2": "<strong>Développeur web et directeurartistique</strong>",
        "Raph3": "Raphaël Chaboiseau, notre designer, a été naturellement désigné grâce à son talent pour le pixel art. À 18 ans, il montre une grande créativité et une maîtrise impressionnante des détails visuels, ce qui fait de lui un atout essentiel pour le projet. Il gère la partie design avec une vision artistique claire et un souci constant du détail, apportant une véritable valeur ajoutée à notre équipe.",
        "Raph4": "",
        "Raph5": "",
        "Thomas1": "<strong> Thomas GRILLO </strong>",
        "Thomas2": "<strong>Multijoueur et responsable IA</strong>",
        "Thomas3": "Thomas, notre expert en multijoueur et IA, est un véritable atout pour l'équipe. Il est capable de gérer les problèmes les plus complexes avec une facilité déconcertante, et sait toujours garder son sang-froid. Il est également un joueur hors pair, ce qui lui permet de tester le jeu sous tous les angles.",
        "Thomas4": "",
        "Thomas5": "",
        "Conclusion1": "Membre de EPITA <strong>Strasbourg</strong>",
        "Conclusion2": "Promo 2029"
      },
      "footer": {
        "terms": "Conditions d'utilisation",
        "privacy": "Avis de confidentialité",
        "copyright": "&copy; 2025 Storcki Corp. Tous droits réservés."
      }
    },
    "Download": {
      "menu": "Accueil",
      "about": "À propos",
      "download": "Téléchargement",
      "contact": "Contact",
      "colorBlind": "Daltonien",
      "language": "Français",
      "mainContent": {
        "paragraph": "Télécharger",
        "paragraph1": "Documents",
        "paragraph2": "Le cahier des charges du projet ainsi que les différents rapports de soutenance sont disponibles ci-dessous.",
        "paragraph3": "Cahier des charges n°1",
        "paragraph4": "Premier cahier des charges rendu en Octobre 2024. <br/>Il comprend l'organisation et les premières idées du projet.",
        "paragraph5": "Rapport de soutenance n°1",
        "paragraph6": "Premier rapport de soutenance rendu en Janvier 2025. <br/>Il fait la rétrospection des éléments mis en place depuis le premier cahier des charges.",
        "paragraph7": "Rapport de soutenance n°2",
        "paragraph8": "Deuxième rapport de soutenance rendu en mars 2025.<br/>Il analyse les progrès réalisés depuis le premier rapport et détaille les ajustements apportés au projet.",
        "paragraph9": "Version allégée du jeu",
        "paragraph10": "Une version simplifiée et optimisée du jeu, disponible en téléchargement.<br/>Elle permet de découvrir les mécaniques principales sans nécessiter de configuration avancée.",
        "paragraph11": "Diagramme de Gantt du projet",
        "paragraph12": "Un aperçu de la chronologie du projet, détaillant les étapes clés et les échéances. <br/>Il offre une vision claire de l'avancement et des tâches à venir."
      },
      "footer": {
        "terms": "Conditions d'utilisation",
        "privacy": "Avis de confidentialité",
        "copyright": "&copy; 2025 Storcki Corp. Tous droits réservés."
      }
    },
    "Privacy-Notice": {
      "mainContent": {
        "paragraph1": "Avis de Confidentialité",
        "paragraph2": "Votre confidentialité est importante pour nous. <br/> Cet avis de confidentialité explique les données personnelles que nous collectons, comment nous les utilisons et vos droits concernant vos données.",
        "paragraph3": "Informations que Nous Collectons",
        "paragraph4": "Nous collectons des informations afin de fournir de meilleurs services à nos utilisateurs. Cela inclut :",
        "paragraph5": "Informations d'identification personnelle (Nom, adresse e-mail, numéro de téléphone, etc.)",
        "paragraph6": "Données d'utilisation (pages visitées, temps passé sur le site, etc.)",
        "paragraph7": "Comment Nous Utilisons ces Informations",
        "paragraph8": "Nous utilisons les informations que nous collectons de différentes manières, notamment pour :",
        "paragraph9": "Fournir, exploiter et maintenir notre site web",
        "paragraph10": "Améliorer, personnaliser et étendre notre site web",
        "paragraph11": "Comprendre et analyser comment vous utilisez notre site web",
        "paragraph12": "Développer de nouveaux produits, services, fonctionnalités et améliorations",
        "paragraph13": "Communiquer avec vous, directement ou via l’un de nos partenaires",
        "paragraph14": "Vos Droits en Matière de Protection des Données",
        "paragraph15": "Vous avez les droits suivants en matière de protection des données :",
        "paragraph16": "<strong>Droit d'accès </strong> – Vous avez le droit de demander des copies de vos données personnelles.",
        "paragraph17": "<strong>Droit de rectification </strong> – Vous avez le droit de demander la correction des informations inexactes.",
        "paragraph18": "<strong>Droit à l'effacement </strong> – Vous pouvez demander la suppression de vos données personnelles sous certaines conditions.",
        "paragraph19": "<strong>Droit de limiter le traitement </strong> – Vous pouvez demander la limitation du traitement de vos données sous certaines conditions.",
        "paragraph20": "<strong>Droit d’opposition au traitement </strong> – Vous pouvez vous opposer au traitement de vos données sous certaines conditions.",
        "paragraph21": "<strong>Droit à la portabilité des données </strong> – Vous pouvez demander le transfert de vos données à une autre organisation ou à vous-même sous certaines conditions.",
        "paragraph22": "Contactez-nous",
        "paragraph23": "Si vous avez des questions concernant cet avis de confidentialité, les données que nous détenons sur vous, ou si vous souhaitez exercer vos droits en matière de protection des données, n’hésitez pas à nous contacter.",
        "paragraph24": "Envoyez-nous un e-mail à : luc.bevilacqua@epita.fr",
        "paragraph25": "Retour à la page d'accueil"
      }
    },
    "terms-of-service": {
      "mainContent": {
        "paragraph1": "Conditions d'utilisation",
        "paragraph2": "Bienvenue sur notre site web. En accédant ou en utilisant notre site, vous acceptez de vous conformer et d'être lié par les conditions générales d'utilisation suivantes, qui, avec notre politique de confidentialité, régissent notre relation avec vous en ce qui concerne ce site web.",
        "paragraph3": "Utilisation du site web",
        "paragraph4": "Le contenu des pages de ce site web est uniquement destiné à votre information générale et à votre usage. Il est sujet à des modifications sans préavis.",
        "paragraph5": "Propriété intellectuelle",
        "paragraph6": "Ce site web contient du matériel qui nous appartient ou qui est sous licence. Ce matériel inclut, mais sans s'y limiter, le design, la mise en page, l'apparence, et les graphismes. La reproduction est interdite.",
        "paragraph7": "Limitation de responsabilité",
        "paragraph8": "Votre utilisation de toute information ou matériel sur ce site web est entièrement à vos risques et périls, pour lesquels nous ne serons pas responsables. Il vous incombe de vous assurer que les produits, services ou informations disponibles sur ce site répondent à vos besoins spécifiques.",
        "paragraph9": "Loi applicable",
        "paragraph10": "Votre utilisation de ce site web et tout différend découlant de cette utilisation sont soumis aux lois de la France.",
        "paragraph11": "Retour à la page d'accueil"
      }
    }
  },
  "en": {
    "Home": {
      "menu": "Home",
      "about": "About us",
      "download": "Download",
      "contact": "Contact",
      "colorBlind": "Color blind mode",
      "language": "English",
      "mainContent": {
        "paragraph0": "Storcki Corp presents",
        "paragraph6": "Plenty Orders",
        "paragraph7": "A fast-paced cooking game where speed, coordination, and multiplayer fun are the keys to success in every service!",
        "paragraph1": "Storcki Corp is much more than just a video game development studio: <br/><br/> it is, above all, a human adventure born from the meeting of five passionate individuals at the EPITA School of Computer Engineering in Strasbourg. <br/><br/> Each member of the studio brings with them a unique story, experience, and set of skills, but all share the same goal: <em>to create innovative and memorable games.</em> <br/><br/> This collaborative project emerged naturally, uniting their talents around an ambitious vision and a burning passion for video games. And it is today in Strasbourg, this city at the crossroads of Europe, that Storcki Corp draws its energy and forges its identity.",
        "paragraph8": "Who we are",
        "paragraph2": "The studio's visual identity was naturally built around a strong and evocative symbol: the stork. <br/><br/> An iconic emblem of Alsace, it represents much more than just a regional nod. <br/> In the collective imagination, the stork is a messenger, an indefatigable traveler capable of covering long distances with remarkable ease. <br/><br/> Like this bird, Storcki Corp aspires to design games that transport players into captivating worlds, where the gaming experience is fluid, immersive, and always in motion. <br/><br/> The choice of this symbol also reflects the studio's spirit: a team that continually evolves, learns, and pushes its own limits, with a constant desire to deliver high-quality games.",
        "paragraph3": "At the heart of Storcki Corp, there is a subtle balance between originality, technical precision, and a touch of humor that spices up each of their creations. <br/><br/> The studio does not simply develop games: <br/> it seeks to offer unique experiences, shaped by meticulous attention to detail and a creative approach that dares to break away from the norm. <br/><br/> Far from standardized formulas, each project is an opportunity to explore new ideas, experiment with bold concepts, and infuse a unique soul into the games that come to life under their expert hands.",
        "paragraph4": "But more than just a collective of developers, Storcki Corp is, above all, a family, where human values take precedence. <br/><br/> Mutual support and inclusivity are not mere slogans, but concrete pillars that structure the team's daily operations. <br/><br/> Every member finds their place, free to contribute their ideas, express their creativity, and actively participate in the studio's evolution. This synergy between complementary talents and shared visions is the key that allows Storcki Corp to grow and evolve towards new horizons.",
        "paragraph5": "Thank you for your support!"
      },
      "footer": {
        "terms": "Terms of Service",
        "privacy": "Privacy Notice",
        "copyright": "&copy; 2025 Storcki Corp. All rights reserved."
      }
    },
    "About_Us": {
      "menu": "Home",
      "about": "About us",
      "download": "Download",
      "contact": "Contact",
      "colorBlind": "Blind mode",
      "language": "English",
      "mainContent": {
        "Motivations": "Our motivations",
        "Projet": "An exciting project!",
        "Qui": "We are a team of 4 students from EPITA, united by our passion for technology and development. For our second-semester project, we chose to create an innovative game that would allow us to push our limits in programming and strengthen our team spirit.",
        "Histoire": "The team naturally formed around our skills and affinities. <br> Hugo, our team leader and level designer, brings a clear and structured vision. <br> Luc, responsible for marketing and gameplay, ensures that our game is both captivating and well-positioned. <br> Raphaël, web developer and artistic director, brings our project to life with his creative talent. <br> Finally, Thomas, expert in multiplayer and AI, ensures a smooth and intelligent gaming experience.",
        "Hugo1": "<strong>Hugo BEFORT</strong>",
        "Hugo2": "<strong>Team Leader and Level Designer</strong>",
        "Hugo3": "Hugo Befort, our project leader, was naturally appointed due to his organizational skills and strategic mindset. At 18 years old, he possesses a maturity far beyond his age and knows how to lead a team with remarkable confidence.",
        "Hugo4": "",
        "Hugo5": "",
        "Luc1": "<strong>Luc BEVILLAQUA</strong>",
        "Luc2": "<strong>Marketing and Gameplay Manager</strong>",
        "Luc3": "Luc, our marketing manager, is not just there to handle marketing but also to be the group's Swiss army knife. Versatile and ready to help at any time, he can be handling publicity one moment and assisting with technical work the next. His goal: to make the project shine while ensuring no one gets lost along the way.",
        "Luc4": "",
        "Luc5": "",
        "Raph1": "<strong>Raphaël CHABOISSEAU</strong>",
        "Raph2": "<strong>Web Developer and Artistic Director</strong>",
        "Raph3": "Raphaël Chaboiseau, our designer, was naturally appointed due to his talent for pixel art. At 18 years old, he demonstrates great creativity and an impressive mastery of visual details, making him a crucial asset to the project. He manages the design with a clear artistic vision and a constant focus on detail, bringing true value to our team.",
        "Raph4": "",
        "Raph5": "",
        "Thomas1": "<strong>Thomas GRILLO</strong>",
        "Thomas2": "<strong>Multiplayer and AI Manager</strong>",
        "Thomas3": "Thomas, our multiplayer and AI expert, is a real asset to the team. He can handle the most complex problems with ease and always remains calm. He is also an exceptional player, which allows him to test the game from all angles.",
        "Thomas4": "",
        "Thomas5": "",
        "Conclusion1": "Member of EPITA <strong>Strasbourg</strong>",
        "Conclusion2": "PROMO 2029"
      },
      "footer": {
        "terms": "Terms of Service",
        "privacy": "Privacy Notice",
        "copyright": "&copy; 2025 Storcki Corp. All rights reserved."
      }
    },
    "Download": {
      "menu": "Home",
      "about": "About us",
      "download": "Download",
      "contact": "Contact",
      "colorBlind": "Blind mode",
      "language": "English",
      "mainContent": {
        "paragraph": "Download",
        "paragraph1": "Documents",
        "paragraph2": "The project specification document and the various presentation reports are available below.",
        "paragraph3": "Specification Document No. 1",
        "paragraph4": "First specification document submitted in October 2024. <br/> It includes the organization and initial ideas of the project.",
        "paragraph5": "Presentation Report No. 1",
        "paragraph6": "First presentation report submitted in January 2025. <br/> It provides a retrospective of the elements implemented since the first specification document.",
        "paragraph7": "Presentation Report No. 2",
        "paragraph8": "Second presentation report submitted in March 2025.<br/>It reviews the progress made since the first report and outlines the adjustments made to the project.",
        "paragraph9": "Lightweight Version of the Game",
        "paragraph10": "A simplified and optimized version of the game, available for download. <br/> It allows players to experience the core mechanics without requiring advanced setup.",
        "paragraph11": "Project Gantt Chart",
        "paragraph12": "An overview of the project's timeline, detailing key milestones and deadlines. <br/> It provides a clear vision of the progress and upcoming tasks."
      },

      "footer": {
        "terms": "Terms of Service",
        "privacy": "Privacy Notice",
        "copyright": "&copy; 2025 Storcki Corp. All rights reserved."
      }
    },
    "Privacy-Notice": {
      "mainContent": {
        "paragraph1": "Privacy Notice",
        "paragraph2": "Your privacy is important to us. <br/> This privacy notice explains the personal data we collect, how we use it, and your rights regarding your data.",
        "paragraph3": "Information We Collect",
        "paragraph4": "We collect information to provide better services to our users. This includes:",
        "paragraph5": "Personal identification information (Name, email address, phone number, etc.)",
        "paragraph6": "Usage data (pages visited, time spent on the site, etc.)",
        "paragraph7": "How We Use this Information",
        "paragraph8": "We use the information we collect in various ways, including to:",
        "paragraph9": "Provide, operate, and maintain our website",
        "paragraph10": "Improve, personalize, and expand our website",
        "paragraph11": "Understand and analyze how you use our website",
        "paragraph12": "Develop new products, services, features, and enhancements",
        "paragraph13": "Communicate with you, directly or through one of our partners",
        "paragraph14": "Your Data Protection Rights",
        "paragraph15": "You have the following data protection rights:",
        "paragraph16": "<strong>Access right</strong> – You have the right to request copies of your personal data.",
        "paragraph17": "<strong>Rectification right</strong> – You have the right to request the correction of inaccurate information.",
        "paragraph18": "<strong>Erasure right</strong> – You can request the deletion of your personal data under certain conditions.",
        "paragraph19": "<strong>Processing limitation right</strong> – You can request the limitation of the processing of your data under certain conditions.",
        "paragraph20": "<strong>Opposition right to processing</strong> – You can object to the processing of your data under certain conditions.",
        "paragraph21": "<strong>Data portability right</strong> – You can request the transfer of your data to another organization or to yourself under certain conditions.",
        "paragraph22": "Contact Us",
        "paragraph23": "If you have any questions about this privacy notice, the data we hold about you, or if you would like to exercise your data protection rights, please do not hesitate to contact us.",
        "paragraph24": "Send us an email at: luc.bevilacqua@epita.fr",
        "paragraph25": "Back to home page"
      }
    },
    "terms-of-service": {
      "mainContent": {
        "paragraph1": "Terms of Service",
        "paragraph2": "Welcome to our website. By accessing or using our site, you agree to comply with and be bound by the following terms and conditions of use, which together with our privacy policy govern our relationship with you in relation to this website.",
        "paragraph3": "Use of the Website",
        "paragraph4": "The content of the pages of this website is for your general information and use only. It is subject to change without notice.",
        "paragraph5": "Intellectual Property",
        "paragraph6": "This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance, and graphics. Reproduction is prohibited.",
        "paragraph7": "Limitation of Liability",
        "paragraph8": "Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services, or information available through this website meet your specific requirements.",
        "paragraph9": "Governing Law",
        "paragraph10": "Your use of this website and any dispute arising out of such use of the website is subject to the laws of France.",
        "paragraph11": "Back to the home page"
      }
    }
  }
}
